       01 inventory-header.
         03 ihdr-product-id pic x(9).
         03 ihdr-sep-1 pic x.
         03 ihdr-quantity pic x(9).

       01 inventory-template.
         03 inv-product-id pic 9(9).
         03 inv-quantity pic 9(9).